🚀&nbsp; env0 had composed a PR Plan for environment [My First Project / PRetty plan-8123](http://pr7347.dev.env0.com/p/f7302a48-f523-4e11-8e35-d49b27587fe4/environments/60bf31a6-46d6-4bd9-afd8-a35f2be1350d):
```
Plan: 5 to add, 0 to change, 4 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

Terraform will perform the following actions:


  # aws_s3_bucket.website_bucket must be replaced
-/+ resource "aws_s3_bucket" "website_bucket" {
+       acceleration_status         = (known after apply)
!       arn                         = "arn:aws:s3:::hello-env0-lpqbaizfdrwgiznn" -> (known after apply)
!       bucket                      = "hello-env0-lpqbaizfdrwgiznn" -> (known after apply) # forces replacement
!       bucket_domain_name          = "hello-env0-lpqbaizfdrwgiznn.s3.amazonaws.com" -> (known after apply)
!       bucket_regional_domain_name = "hello-env0-lpqbaizfdrwgiznn.s3.amazonaws.com" -> (known after apply)
!       hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
!       id                          = "hello-env0-lpqbaizfdrwgiznn" -> (known after apply)
!       region                      = "us-east-1" -> (known after apply)
!       request_payer               = "BucketOwner" -> (known after apply)
-       tags                        = {} -> null
!       website_domain              = "s3-website-us-east-1.amazonaws.com" -> (known after apply)
!       website_endpoint            = "hello-env0-lpqbaizfdrwgiznn.s3-website-us-east-1.amazonaws.com" -> (known after apply)
        # (2 unchanged attributes hidden)

!       versioning {
!           enabled    = false -> (known after apply)
!           mfa_delete = false -> (known after apply)
        }

!       website {
!           error_document = "index.html" -> "error.html"
            # (1 unchanged attribute hidden)
        }
    }


  # aws_s3_bucket_object.error will be created
+   resource "aws_s3_bucket_object" "error" {
+       acl                    = "private"
+       bucket                 = (known after apply)
+       content_type           = "text/html"
+       etag                   = (known after apply)
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "error.html"
+       server_side_encryption = (known after apply)
+       source                 = "index.html"
+       storage_class          = (known after apply)
+       version_id             = (known after apply)
    }


  # aws_s3_bucket_object.object must be replaced
-/+ resource "aws_s3_bucket_object" "object" {
!       bucket                 = "hello-env0-lpqbaizfdrwgiznn" -> (known after apply) # forces replacement
!       etag                   = "7497ae336f55298f7959affa7da14197" -> (known after apply)
!       id                     = "index.html" -> (known after apply)
-       metadata               = {} -> null
+       server_side_encryption = (known after apply)
!       storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
+       version_id             = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_bucket_policy.website_bucket_policy must be replaced
-/+ resource "aws_s3_bucket_policy" "website_bucket_policy" {
!       bucket = "hello-env0-lpqbaizfdrwgiznn" -> (known after apply) # forces replacement
!       id     = "hello-env0-lpqbaizfdrwgiznn" -> (known after apply)
!       policy = jsonencode(
            {
-               Id        = "Public-Access"
-               Statement = [
-                   {
-                       Action    = "s3:GetObject"
-                       Effect    = "Allow"
-                       Principal = "*"
-                       Resource  = "arn:aws:s3:::hello-env0-lpqbaizfdrwgiznn/*"
-                       Sid       = "Allow-Public-Access-To-Bucket"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }


  # random_string.random must be replaced
-/+ resource "random_string" "random" {
!       id          = "lpqbaizfdrwgiznn" -> (known after apply)
!       length      = 16 -> 15 # forces replacement
!       min_lower   = 16 -> 15 # forces replacement
!       result      = "lpqbaizfdrwgiznn" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 5 to add, 0 to change, 4 to destroy.

Changes to Outputs:
!   url = "hello-env0-lpqbaizfdrwgiznn.s3-website-us-east-1.amazonaws.com" -> (known after apply)
```
</details>


[Full PR Plan logs on env0](http://pr7347.dev.env0.com/p/f7302a48-f523-4e11-8e35-d49b27587fe4/environments/60bf31a6-46d6-4bd9-afd8-a35f2be1350d/deployments/fca3982a-823b-4cb5-9b72-a445fb19ddd4)